

  {
  "version": ["Version 0.01 - 8th June 2018","Version 0.02 - 11th June 2018","Version 0.03 - 13th June 2018","Version 0.04 - 18th June 2018","Version 0.05 - 25th June 2018","Version 0.06 - 30th june 2018","Version 0.07 - 3rd July 2018","Version 0.08 - 4th July 2018","Version 0.09 - 10th July 2018","Version 0.10 - 13th July 2018","Version 0.11 - 13th July 2018","Version 0.12 - 21th July 2018","Version 0.13 - 24th July 2018","Version 0.14 - 26th July 2018","Version 0.15 - 30th July 2018","Version 0.16 - 3rd August 2018","Version 0.17 - 8th August 2018","Version 0.18 - 17th August 2018","Version 0.19 - 24th August 2018","Version 0.20 - 12th Sep 2018","Version 0.21 - 19th Sep 2018","Version 0.22 - 28th Sep 2018","Version 0.23 - 6th Oct 2018","Version 0.23.1 - 15th November 2018","Version 0.23.2 - 20th November 2018","Version 0.36 - 1st Mar 2019","Version 0.40 - 4th Mar 2019","Version 0.41 - 5th Mar 2019","Version 0.42 - 8th Mar 2019","Version 0.43 - 15th Mar 2019","Version 0.44 - 21st Mar 2019","Version 0.44 - 21st Mar 2019","Version 0.46 - 5th Apr 2019","Version 0.47 - 7th May 2019","Version 0.48 - 24th May 2019","Version 0.50 - 28th May 2019","Version 0.51 - 29th May 2019","Version 0.52 - 30th May 2019","Version 0.53 - 31st May 2019","Version 0.54 - 3rd June 2019","Version 0.55 - 10th June 2019"],
  "feedback": ["\n• Basic iOS pattern setup \n\n• Register UI & API implemented \n\n• Login UI & API implemented\n\n• Random Quote display in home screen which is added in the DB \n\n• List of courses - Dashboard screen\n\n• Lock feature\n\n• Course categories list\n\n• Content display\n\n• Download and share the content - Native share screen.\n\n• Re-Upload from iCloud.\n\n• Bulb Feature - To add and view comments/Suggestions\n\n• Force to turn the mobile in landscape mode.","\n• Popup missing in case user details are not in DB -> E-Mail / Password combination not recognised. Please try again..\n\n• Create can take over email / pwd from previous screen if something has been entered.\n\n• Forget password icon/feature missing (see page 10 in ppt) .\n\n• Remove the 'Next' button and have the entire text serve the function of next...so the user can click anywhere on the text in order to see the next random quote.\n\n• Remove the  from the text.\n\n• Stay in same font size as the rest of the text above...no change in font size per quote....just use more or less space.\n\n• Currently its cycling through the quotes....don't do that...show randomly only 1 and then only on user click present the next randomly selected one.\n\n• Buttons for Hours and Min are too small...increase for better accessibility.\n\n• Number format or hours is only 0 one digit .\n\n• Min increment is 15min.\n\n• Have standard min 45 at start","\n• Remember the user choice for the time and next time keep it as last time.\n\n• App recognises when in background and after 15min this start screen comes up instead of the usual last screen the user left the app.\n\n• Once user is logged in already click on profile pic does not lead to login page but to profile page\n\n• Course table: target audience tags are missing e.g., #consultant, # jobseeker, #analyst (see page 11 of PPT)\n\n• Comments table: missing position of the bubble as it points towards a specified location on the screen\n\n• Comments table: missing flag for anonymous (in case the user doesn't want to expose himself)","\n• Login with Facebook has been completed.","\n• On App start check when app last have been used. If >1 day then always start here otherwise in module last used\n\n• Have timer run accordingly and notification popup a reminder after countdown “Planned time is up”\n\n• List of quotes - Offline feature done\n\n• Login - Offline feature done","\n• Add Project\n\n• Edit Project\n\n• Delete Project\n\n• UI Implementation for project list\n\n• Applying Tool/Scale design for (Value Added, Project Status Details, Career, Work-life Balance)\n\n• Value Added - API integration\n\n• Bar-chart for value added\n\n• Line-chart for Work-life balance\n\n• Popup for adding positive/negatives of the project","\n• API creation for adding project details/add meeting notes for Tracking tool\n\n• API creation for career in Tracking tool\n\n• API creation for work-life balance for Tracking tool\n\n• Timeline chart to view whole project status in single page with scroll option\n\n• Value Added API Integration\n\n• Chart glitches need to fixed","\n• Tracking tool implemented\n\n• Value Added Bar chart integration\n\n• Project Status - Add Positive, Add Negative\n\n• Project Status - Timeline chart integration\n\n• Project Status - Line chart integration\n\n• Career - Add Positive, Add Negative\n\n• Career - Timeline chart integration\n\n• Career - Line chart integration\n\n• Work life Balance - Add Work, Add Stress, Add Relax and Add Sleep\n\n• Work life Balance - Multiline chart integration","\n• Added sliding gesture to the quotes\n\n• Added clock timer in start page\n\n• Un-like quote features implemented\n\n• Version history added\n\n• Profile page completed\n\n• Career ladder added\n\n• Reminder design completed","\n• Login with Facebook issues fixed\n\n• Added profile image in Bottom tab bar\n\n• Reminder section completed\n\n• Career Level Field is added in Profile screen\n\n• Value added loaded chart with real data\n\n• Added person position in the career level","\n• Facebook Crash Issue\n\n• Profile pic default image need to set if no image coming from fb/profile\n\n• Like /dislike animation Comment popup changes - Anonymous/Me remove extra space in between\n\n• Crashlytics\n\n• Sub Menu Design Changed","\n• Tab bar - text Removed\n\n• Replaced course list content\n\n• Add Project Text field alignment issue fixed\n\n• Remove success popup in profile screen\n\n• + animation need speedup\n\n• Remove Job Seeker from ladder and make Italic.\n\n• Each menu need to navigate to correct screen like Reminder -> reminder screen, Resources -> Resources screen - Done\n\n• Added original 10 images in call4backup screen.\n\n• Admin View added in Profile Screen.\n\n•  Add Project remove current date validation.\n\n• Call4Backup design completed\n\n• Send request screen design completed\n\n• Resource screen UI implementation Done\n\n• Invite Friend screen design completed","\n• Quote Changes - Swipe right random quote / Swipe left viewed quotes in order\n\n• + blurred screen need to go back once clicked again\n\n• 2 Reminders should need to be there static\n\n• Increase the circle sizes\n\n• Remove the ugly white space in call4Backup screen\n\n• Call4Backup list text should be visible\n\n• Call4BackUp - Add attachment not working\n\n• Call4BackUp - remote/onsite alignment issue\n\n• Call4Back - Add confirmation popup\n\n• Invite Colleagues - Import own contacts\n\n• Admin view - Swipe function\n\n• Tracking scales need to be dynamic","\n•  Resource  add Comment Api integrated\n\n• Resource Comment List Api integrated\n\n• Remainder add Comment Api integrated\n\n•  Remainder Comment List Api integrated\n\n•  invite Friends  add Comment Api integrated\n\n•  Invite Friends  Comment List Api integrated\n\n• Profile   add Comment Api integrated\n\n•  Profile Comment List Api integrated\n\n• Tracking  add Comment Api integrated\n\n•  Tracking Comment List Api integrated\n\n• Admin screen Animation","\n• In this video i only clicked on + to see the menu and + again to remove the menu...the previous screen and the highlighted previous menu icon was done automatic\n\n• Some more items...the “+” menu  when pressed again the menu collapses again and the blurred screen stops...the content to see is the last other menu item\n\n• The lightbulb icon for the comments has moved down into the text area\n\n• Like system cycles only through 2 states\n\n• Project overview: lightbulb has moved down into the text area\n\n• Admin menu: seems like a delay between the swiping from the side and the start of the animation....should be kind of like swiping and the menu opens with the finger....ALSO: when closing with the back arrow the animation should go to the right and not left (back to where it was)\n\n• Tracking: Timeline (no space) with name -> Project timeline name of screen and Career timeline name of screen. Same for chart: Project diagram and Career diagram\n\n• Call4Backup: Transparent bars below text only as long as the text itself\n\n• Add project: when starting to type project name or client the first letter should be capital - Fixed\n\n• Profile: Logout doesn't work - Fixed","\n• Profile: move “Career level” text down as it labels the ladder. Instead call this line: “Consulting Company:”. for a new user the “Consulting Company:” says “Please choose your current/desired firm” (and only show the ladder once a firm is selected\n\n• Menu bar: increase icons to fill out space of previous text written below the icons\n\n• tracking: animation for the scale has only 3 states....please add more subtle steps 5 on negative and 5 on positive (with neutral being an additional state)\n\n• Profile pic on start screen not in sync with profile pic in profile screen\n\n• STILL NOT WORKING Profile: Logout doesn't work (see pic after logging out)\n\n• Profile: when editing the profile picture the selector is quadratic whereas the used part is circular\n\n• Tracking: replace “current project” with the actual project name\n\n• Tracking: career ladder is not in sync with the one chosen in profile\n\n• Instabug sdk integrated","\n• Profile: move the Edit menu items under the profile pic in the profile screen....no needs for an extra edit menu....this means then also that tab open the profile pic itself gives choice to change as it is working already in the Edit sub screen.\n\n•  Add/edit projects: use different style of input fields\n\n• Invite colleagues: lets make it simpler...take out the list of contacts from the buttom and use the screen for the other items.....then have the button invite colleagues go to a normal contract list with search bar on top (guess this is standard) to select a contact...on selecting one contact ask for email or SMS and proceed accordingly.....\n\n• Profile pic: not working with Facebook login and when chosen manually not in sync with start screen or menu pic.\n\n• Tracking: Change Career under career tracker to company name chosen in Profile\n\n• Tracking: don't allow to change the career steps of the ladder....this should solely work in profile\n\n• Tracking: + icon of menu left over\n\n• Profile: when editing the profile picture the selector is quadratic whereas the used part is circular (see picture). iOS Default\n\n• Admin menu: when closing with the back arrow the animation should go be reverse to opening (now just disappears)","\n• Meeting manager speech API integrated\n\n• Small UI glitches in Meeting manager is in progress\n\n• Email template 80% data filled.\n\n• Capture Vision API integrated\n\n• Capture Data filling to pie chart facing some issues due to detected element is not coming only as integer.\n\n• Capture API Integration is in progress.","\n •Capture Module Completed\n\n• Login with firebase \n\n• SignUp with firebase\n\n• Get user detail with firebase\n\n• Update user detail with firebase\n\n• Forgot password with firebase\n\n• Login with Facebook in firebase\n\n• List quotes with firebase\n\n• Like and dislike with firebase","\n• All API has been migrated to Firebase\n\n• Now, the complete app is dependent on firebase. No backend PHP server is needed","\n• Two reminders should need to be there always as static.\n\n• Meeting manager function will restrict guest to login to use this feature.\n\n• Graphic error in reminder screen - Fixed\n\n• Geo fencing\n\n• Capture function will restrict guest to login to use this feature.\n\n• Anonymous user sharing the same reminders - Fixed","\n•  And by default please for custom reminders enable Mo-Fri\n\n•  And make the icons for the days larger please\n\n•  Use all space left to right to size the circle days symbols\n\n•  Tried custom location reminder...works!  But we should have better text of the notification itself...the headline is correctly the custom title chosen by user...the rest should be “leaving your location” or “arriving at your location”\n\n• For the location reminders please change the symbol according to “arriving” or “leaving”. And let your designers create the symbols the show way...thanks","\n• Create call 4 back request by adding audio or video or docs\n\n• Send the request mail to login user now for testing purpose\n\n• If the file less than 15 mb then attached  directly as zip else download link added\n\n• List out the call 4 back up\nNote : above feature only when user login\n\n• Invite func separate design for contact (design change from the last feedback)","\n• The plus sign is missing after i created a new project!!!","\n• Create call 4 back request by adding audio or video or docs \n\n• Send the request mail to login user now for testing purpose \n\n• If the file less than 15 mb then attached  directly as zip else download link added \n\n• List out the call 4 back upNote : above feature only when user login \n\n• Invite func separate design for contact (design change from the last feedback)","\n• The plus sign is missing after i created a new project!!! \n\n• Also there was an old popup with a “success project created” which we don’t need anymore. \n\n• Why is delete of the tool not working???  \n\n• I would expect you can delete the week prep tool and then put it back from the + menu. \n\n•  the date of birth is again not saved!!!! ","\n• Change Week Prep Header    \n\n• After delete the app the user settings for reminders should have been deleted! and Default reminders should be stay.   \n\n• Apply List delete function completed  \n\n• Remove Edit and Admin Button from Profile Screen ","\n• resources not pre-loaded (i installed, went passed the splash screen and turned off the wifi. FAQ worked but resources not!) - Fixed  \n\n•  App un-install deletes all stored data of the device - Fixed \n\n• adding tools: delete popup & deleting tools: delete popup - Fixed \n\n• Headline of week preparation starts with a capital W -Fixed \n\n• replace all plus symbols in the overview screen (learning + applying) with the “+” symbol of the 3 rings - Fixed","\n• Light bulb symbol for instabug not working eg in profile and week prep - **Not working in profile page.** - Fixed \n\n• start screen: remove the employer logos and keep simply the GICM logo on the start screen / add once progress bar is finished sentence :”Tab to continue” - **Tab to continue text is missing. Kindly check it.**  - Fixed \n\n• first lines starting the ladder are around “Business Analyst” whereas always before each companies ladder is a “Job seeker” who is just attached infront of the first vertical line (no own lines) - **Fixed (But the vertical lines are touching the text. Kindly leave space.**  - Fixed \n\n• adding tools: delete popup & deleting tools: delete popup - **The pop up and content should be in same line.**  - Fixed \n\n• if we select project list add project button will hide  . Here add project button will display .   - Fixed \n\n• New Design for Call4backup send data Screen  - Fixed \n\n• New Design for Call4backup List Screen   - Fixed \n\n• Profile: left over screen with admin and edit...please remove / add small “Edit” text on lower part of the picture symbol as we had it before...tab on it stays as is in opening pic or make photo  _ Fixed \n\n• Profile carrer ladder: “job seeker” is before the ladder starts and does not have lines around it  - Fixed \n\n• Week prep: counting of weeks starts with 1 in first week of the project and not with 0 as currently counted   - Fixed \n\n• Intro screen with cut of text “Dont show again”  - Fixed \n\n• Lightbulb symbol for instabug not working eg in profile and week prep  - Fixed \n\n• profile: username was anonymous and when defining workstreams it changed to the workstream name!!!?!?!?!??!!?!   - Fixed\n\n• start screen: remove the employer logos and keep simply the GICM logo on the start screen / add once progress bar is finished sentence :”Tab to continue” . - Fixed ","\n• profile completeness: calculate the empty and filled fields in profile (dob, career level etc) and calculate completeness % (details inside). \n\n•  meeting manager: use square checkbox for confirmation (which can be on or off: default off) instead of round multiple choice option \n\n•   Update instabug SDK to latest 8.1 \n\n•  Meeting Manager - Kindly differentiate subpart from main part and subpart checkboxes. \n\n•  Menu bar transition animation changed \n\n• add to tracking (now both iOS and Android) on top of the other sections a new section: “Are you happy with today?” With options: “yes!”, “was ok”and “no” and if “no” option is selected a text field labeled “Why and how to do it next time better”. This metric does not affect the scale but  is recorded with the other metrics and can in the timeline be revisited  \n\n• Migrate Release notes to Firebase (like FAQ) and keep them up to date please!- **Fixed (But it takes much time to load in offline. \n\n• Communication basics and  Consulting buzz words added in Course List  \n\n• Profile icons  Changed now we are using multiple profile icons based on profile strength \n\n• UPDATED: meeting manager: remove from config screen line “Management Consulting” but keep in background the config for the translation and submit “management consulting” to set this area for the transition. (More inside) \n\n•  Profile Menu - DOB should not have future dates.  \n\n•  Profile Menu - The selected company is not getting saved in the Employer section when switching to other menu and coming back to profile menu again We must select posting also \n\n•  profile completeness: calculate the empty and filled fields in profile (dob, career level etc) and calculate completeness % (details inside) - The profile icon should be changed in Green colour while indication completeness %. \n\n• In call4backup  Gradient Progress bar design completed \n\n• replace all plus symbols in the overview screen (learning + applying) with the “+” symbol of the 3 rings","\n• career ladder: “Job Seeker” the first in each of the career options right now cannot be selected. Make it selectable and to emphasize the selection change colour as in the other career steps and also underline when selected. \n\n• Meeting Manager: buttons pressed e.g., Action Item not only records the button pressed but also when it was done as 'time' and a short 'sentence' around that time from the transcript \n\n• Profile – Add Project – The colour of the status bar / ‘Add Project’ button is different compare to the other screens \n\n• The icons in the Contribution page are seems stretchy \n\n• Contribution page – The text in the title bar can aligned further upward, as the text in the second line of title is touching the title bar’s border \n\n• Adding courses: Should be done in same way as tools. Remove 'Select Role' function and immediately show the list of courses. When course is taped then move back to overview screen without popup \n\n• In Profile screen my goal section Timing text is not showing clearly \n\n• Week prep: If a project is defined without a workstreams then display in Week Prep a 'Default (Me)' Work stream \n\n• Crash issue fixed in weekly planner screen \n\n•  In Profile screen  email validation alert showing continuously  \n\n• Week Preparation – when Placing the cursor in any one of the column and clicking on done button in keypad without entering any values, the space between  Week prep name and ‘’(ME)’’ is getting increased","\n• Profile: default for employer “Select your company” (company with small letter) \n\n•  Profile: change goal section. Have the chosen goal listed in one line “My goal: xxxx in yyyy months” / initially default have “Select your goal” / when tabbed then the existing selections pops up and after selecting disappears again so that only the one line above stays \n\n•  Release Notes arrange in Order \n\n• display build number in Release note screen header \n\n• Placing the cursor in any one of the column and clicking on done button in keypad without entering any values, when again placing the cursor in the column the keypad hides automatically and the spade between the Week prep name and (ME) is getting increased \n\n• Week Prep: add hours to work/me-time slider (additional to the %) start with 50 hrs work vs 35 me-time (Calc: 24 hrs - 7 hrs sleep = 17 - 10 hrs work = 7 free time) / also add in different colour an area of 7 hrs of sleep (slide cannot go into this area BUT the area can be dragged in itself to increase or decrease to 9hrs max or 5 hrs min / the percentage is meant for the 'awake' time ands is 24 hrs - sleep) \n\n• Week Preparation – Align the Me Time indicator(Percentage and Time) in centre","\n• make the default reminder deletable again (i think is better...no extra feature...like any other reminder can be deleted as well) \n\n•  add to traking (now both iOS and Android) ontop of the other sections a new section: “Are you happy with today?” With options: “yes!”, “was ok”and “no” and if “no” option is selected a text field labeled “Why and how to do it next time better”. This metric does not affect the scale but is recorded with the other metrics and can in the timeline be revisted. \n\n•  Meeting Manager WORD file corrupt on MS Office for MAC \n\n• profile: add category of projects to project definition \n\n•  Show content view floating button animation Issue \n\n•  profile goal defintion: open new page headline “compatible goals for consutlants”. (Content of page inside) \n\n• Add “Leaderboard” as lowest entry in the popup menu (formerly + menu)","\n• Removed Goal definition and Project definition from Profile Screen \n\n• Project category fields added in Add project screen \n\n• Breath reset added in Tools List \n\n• In Reminder List Added three default reminders \n\n• Release Notes UI Design changed","\n• (145) applying: have the 3 default tools corresponding to the 3 default reminders listed (especially in new installation - once user changed its setting then this overrides the default)\n\n• (147) take out all prices from the tools...remove in wallet bar the & currency symbol..replace with internal GICM currency symbol designed\n\n• (151) meeting manager: use round radio buttons for “Airtime only” or Transcribe \n\n• (153) profile: when deleting a project the screen is not refreshed and it seems the project is still there but internally it seems to be deleted right \n\n• (155) Change title of Learning simply to LEARN / Change title of Applying simply to APPLY \n\n• (156) Adding courses: change title and section text \n\n• (157) Adding tools: change title and section text \n\n• (158) Profile New project: have all items in the list start with capital letter","\n• (148) remove buying dialog... \n\n• profile: a) move timing buttons above goal list and have them nicely designed please by Vishnu b) make “Compare myself” an own section on level of Goal, Employer, Projects. \n\n• (146) switch all Firebase urls to new domain ...firebaseapp.com (to enable china access) \n\n• (149) add a splash screen infront of all remaining tools with dummy video/ dummy text and dont show anymore cliick box like we have it for the weekly planner tool","\n• App Crash issue fixed","\n• (151) meeting manager: use round radio buttons for 'Airtime only' or 'Transcribe'  \n\n• (160) profile goals: when “other” selected then the graphic is distorted due to the additional text field. I suggest to return with the item list to a normal item checklist behavior (not the dynamic resort of now) ... this should simplify this part \n\n• In Apply List tools text hidden Issue Fixed \n\n• LeaderBoard decimal number issue Fixed","\n•  send log file function added in profile screen","\n• Intransit Reminder issue fixed \n\n• Tools splash screen details added in Firebase database ","\n• (165) In-transit notification: when clicking on the notification the breath reset tool screen should be opened \n\n• (166) UPDATE in-transit issues on iphone7: inside"]
  }
  

  


